In [1]:
import pandas as pd

In [2]:
dj = pd.read_csv("DJIA_table.csv")
news = pd.read_csv("RedditNews.csv")

In [3]:
dj.head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

In [4]:
news.head()

         Date                                               News
0  2016-07-01  A 117-year-old woman in Mexico City finally re...
1  2016-07-01   IMF chief backs Athens as permanent Olympic host
2  2016-07-01  The president of France says if Brexit won, so...
3  2016-07-01  British Man Who Must Give Police 24 Hours' Not...
4  2016-07-01  100+ Nobel laureates urge Greenpeace to stop o...

In [5]:
#dj.isnull().sum

In [6]:
#news.isnull().sum()

In [7]:
dj.shape

(1989, 7)

In [8]:
news.shape

(73608, 2)

In [9]:
len(set(news.Date))

2943

In [10]:
news = news[news.Date.isin(dj.Date)]

In [11]:
len(set(news.Date))

1989

In [12]:
dj.head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

In [13]:
dj = dj.set_index('Date').diff(periods=1)

In [14]:
dj.head()

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2016-07-01,NaN,NaN,NaN,NaN,NaN,NaN
2016-06-30,-211.480468,-71.771484,-205.109375,-19.378907,50870000.0,-19.378907
2016-06-29,-256.740235,-226.099609,-255.781250,-235.310546,-26650000.0,-235.310546
2016-06-28,-265.509765,-294.789063,-265.509765,-284.958985,5810000.0,-284.958985
2016-06-27,164.701172,-54.509765,-127.429688,-269.480469,26550000.0,-269.480469

In [15]:
dj['Date'] = dj.index

In [16]:
dj.head()

,Open,High,Low,Close,Volume,Adj Close,Date
Date,,,,,,,
2016-07-01,NaN,NaN,NaN,NaN,NaN,NaN,2016-07-01
2016-06-30,-211.480468,-71.771484,-205.109375,-19.378907,50870000.0,-19.378907,2016-06-30
2016-06-29,-256.740235,-226.099609,-255.781250,-235.310546,-26650000.0,-235.310546,2016-06-29
2016-06-28,-265.509765,-294.789063,-265.509765,-284.958985,5810000.0,-284.958985,2016-06-28
2016-06-27,164.701172,-54.509765,-127.429688,-269.480469,26550000.0,-269.480469,2016-06-27

In [17]:
dj = dj.reset_index(drop=True)

In [18]:
dj.head()

,Open,High,Low,Close,Volume,Adj Close,Date
0,NaN,NaN,NaN,NaN,NaN,NaN,2016-07-01
1,-211.480468,-71.771484,-205.109375,-19.378907,50870000.0,-19.378907,2016-06-30
2,-256.740235,-226.099609,-255.781250,-235.310546,-26650000.0,-235.310546,2016-06-29
3,-265.509765,-294.789063,-265.509765,-284.958985,5810000.0,-284.958985,2016-06-28
4,164.701172,-54.509765,-127.429688,-269.480469,26550000.0,-269.480469,2016-06-27

In [19]:
dj = dj.drop(['High', 'Low', 'Close', 'Volume', 'Adj Close'], 1)

In [20]:
dj.head()

         Open        Date
0         NaN  2016-07-01
1 -211.480468  2016-06-30
2 -256.740235  2016-06-29
3 -265.509765  2016-06-28
4  164.701172  2016-06-27

In [21]:
dj = dj[dj.Open.notnull()]

In [23]:
#dj.isnull().sum()

Open    0
Date    0
dtype: int64